/*:ts=8*/
/*****************************************************************************
 * FIDOGATE --- Gateway UNIX Mail/News <-> FIDO NetMail/EchoMail
 *
 * $Id: charset.latin1.h,v 4.1 1996/05/07 19:50:44 mj Exp $
 *
 * ^ACHARSET conversion tables
 *
 *****************************************************************************
 * Copyright (C) 1990-1996
 *  _____ _____
 * |     |___  |   Martin Junius             FIDO:      2:2452/110
 * | | | |   | |   Republikplatz 3           Internet:  mj@fido.de
 * |_|_|_|@home|   D-52072 Aachen, Germany
 *
 * This file is part of FIDOGATE.
 *
 * FIDOGATE is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the
 * Free Software Foundation; either version 2, or (at your option) any
 * later version.
 *
 * FIDOGATE is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * General Public License for more details.
 * 
 * You should have received a copy of the GNU General Public License
 * along with FIDOGATE; see the file COPYING.  If not, write to the Free
 * Software Foundation, 675 Mass Ave, Cambridge, MA 02139, USA.
 *****************************************************************************/

{
	/***** Default - common characters ********/
	"Ç", "ü", "é", "â", "ä", "à", "å", "ç", 
	"ê", "ë", "è", "ï", "î", "ì", "Ä", "Å", 
	"É", "æ", "Æ", "ô", "ö", "ò", "û", "ù", 
	"ÿ", "Ö", "Ü", "¢", "£", "¥", "Pt", "f",
	"á", "í", "ó", "ú", "ñ", "Ñ", "ª", "º", 
	"¿", "-", "¬", "½", "¼", "¡", "«", "»", 
	"#", "#", "#", "|", "|", "|", "|", "+", 
	"+", "|", "|", "+", "+", "+", "+", "+", 
	"+", "-", "-", "|", "Ä", "+", "|", "|", 
	"+", "+", "=", "=", "|", "=", "+", "=", 
	"-", "=", "-", "+", "+", "+", "Ö", "|", 
	"+", "+", "+", "#", "Ü", "|", "|", "ß", 
	"alpha", "ß", "Gamma", "pi", "ä", "sigma", "µ", "tau", 
	"Phi", "Theta", "Omega", "delta", "infty", "phi", "in", "cap", 
	"==", "±", ">=", "<=", "integ1", "integ2", "ö", "~=", 
	"°", ".", "·", "sqrt", "ü", "²", "o", " "
},
{
	/***** ISO LATIN-1 ************************/
	"?", "?", "?", "?", "?", "?", "?", "?", 
	"?", "?", "?", "?", "?", "?", "?", "?", 
	"?", "?", "?", "?", "?", "?", "?", "?", 
	"?", "?", "?", "?", "?", "?", "?", "?", 
	"?", "¡", "¢", "£", "¤", "¥", "¦", "§", 
	"¨", "©", "ª", "«", "¬", "­", "®", "¯", 
	"°", "±", "²", "³", "´", "µ", "¶", "·", 
	"¸", "¹", "º", "»", "¼", "½", "¾", "¿", 
	"À", "Á", "Â", "Ã", "Ä", "Å", "Æ", "Ç", 
	"È", "É", "Ê", "Ë", "Ì", "Í", "Î", "Ï", 
	"Ð", "Ñ", "Ò", "Ó", "Ô", "Õ", "Ö", "×", 
	"Ø", "Ù", "Ú", "Û", "Ü", "Ý", "Þ", "ß", 
	"à", "á", "â", "ã", "ä", "å", "æ", "ç", 
	"è", "é", "ê", "ë", "ì", "í", "î", "ï", 
	"ð", "ñ", "ò", "ó", "ô", "õ", "ö", "÷", 
	"ø", "ù", "ú", "û", "ü", "ý", "þ", "ÿ", 
},
{
	/***** IBM PC *****************************/
	"Ç", "ü", "é", "â", "ä", "à", "å", "ç", 
	"ê", "ë", "è", "ï", "î", "ì", "Ä", "Å", 
	"É", "æ", "Æ", "ô", "ö", "ò", "û", "ù", 
	"ÿ", "Ö", "Ü", "¢", "£", "¥", "Pt", "f",
	"á", "í", "ó", "ú", "ñ", "Ñ", "ª", "º", 
	"¿", "-", "¬", "½", "¼", "¡", "«", "»", 
	"#", "#", "#", "|", "|", "|", "|", "+", 
	"+", "|", "|", "+", "+", "+", "+", "+", 
	"+", "-", "-", "|", "-", "+", "|", "|", 
	"+", "+", "=", "=", "|", "=", "+", "=", 
	"-", "=", "-", "+", "+", "+", "+", "|", 
	"+", "+", "+", "#", "n", "|", "|", "~", 
	"alpha", "ß", "Gamma", "pi", "Sigma", "sigma", "µ", "tau", 
	"Phi", "Theta", "Omega", "delta", "infty", "phi", "in", "cap", 
	"==", "±", ">=", "<=", "integ1", "integ2", "÷", "~=", 
	"°", ".", "·", "sqrt", "^n", "²", "o", " "
},
{
	/***** MACINTOSH **************************/
	"Ä", "Å", "Ç", "É", "Ñ", "Ö", "Ü", "á", 
	"à", "â", "ä", "ã", "å", "ç", "é", "è", 
	"ê", "ë", "í", "ì", "î", "ï", "ñ", "ó", 
	"ò", "ô", "ö", "õ", "ú", "ù", "û", "ü", 
	"¾", "°", "¢", "£", "§", "o", "¶", "ß", 
	"®", "©", "TM", "´", "¨", "­", "Æ", "Ø", 
	"?", "±", "²", "³", "¥", "µ", "¦", "?", 
	"?", "¹", "¼", "ª", "º", "½", "æ", "ø", 
	"¿", "¡", "¬", "?", "f", "~=", "?", "«", 
	"»", "..", " ", "À", "Ã", "Õ", "OE", "oe", 
	"Ð", "-", "\"", "\"", "`", "'", "/", "×", 
	"ÿ", "?", "?", "¤", "?", "Ý", "Þ", "?", 
	"?", "·", "?", "?", "?", "Â", "Ê", "Á", 
	"Ë", "È", "Í", "Î", "Ï", "Ì", "Ó", "Ô", 
	"ð", "Ò", "Ú", "Û", "Ù", "?", "?", "?", 
	"¯", "?", "?", "?", "¸", "ý", "þ", "?"
}
